# Компʼютерний практикум №2
Виконав студент групи ЗК-41мп Гломозда Костянтин

ОСНОВИ РОБОТИ З БІБЛІОТЕКОЮ PANDAS

# Завдання 1

In [10]:
import pandas as pd
import os

file_path = os.path.join('data/train.csv')
titanic_data = pd.read_csv(file_path, index_col='PassengerId')

titanic_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

a) Яка кількість чоловіків і жінок їхала на кораблі? Приведіть два числа через пробіл.

In [11]:
gender_counts = titanic_data['Sex'].value_counts()

print(gender_counts['male'], gender_counts['female'])

577 314

b) Якій частині пасажирів вдалося вижити? Порахуйте частку пасажирів, що вижили.

In [12]:
survival_rate = (titanic_data['Survived'].mean() * 100).round(2)

print(survival_rate)

38.38

c) Яку частку пасажири першого класу складали серед всіх пасажирів?

In [13]:
first_class_rate = (titanic_data['Pclass'].value_counts(normalize=True)[1] * 100).round(2)

print(first_class_rate)

24.24

d) Якого віку були пасажири? Порахуйте середнє і медіану віку пасажирів.

In [14]:
mean_age = titanic_data['Age'].mean().round(2)
median_age = titanic_data['Age'].median()

print(mean_age, median_age)

29.7 28.0

e) Чи корелює число братів / сестер / подружжя з числом батьків / дітей?

In [15]:
correlation = titanic_data[['SibSp', 'Parch']].corr(method='pearson').iloc[0, 1]

print(correlation)

0.41483769862015624

f) Яке найпопулярніше жіноче ім'я на кораблі?

In [16]:
female_names = titanic_data[titanic_data['Sex'] == 'female']['Name']
first_names = female_names.str.extract(r'(\w+)\)').fillna(female_names.str.extract(r'Miss\. (\w+)'))
most_common_female_name = first_names[0].value_counts().idxmax()

print(most_common_female_name)

Anna

# Завдання 2

In [17]:
path_2 = os.path.join('data/cwurData.csv')
cwur_data = pd.read_csv(path_2)

cwur_data.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

a) У рейтингу залиште тільки дані за 2015 рік.

In [18]:
data_2015 = cwur_data[cwur_data['year'] == 2015]

data_2015.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1200,1,Harvard University,USA,1,1,1,1,1,1,1,1.0,3,100.00,2015
1201,2,Stanford University,USA,2,9,2,4,5,3,3,4.0,10,98.66,2015
1202,3,Massachusetts Institute of Technology,USA,3,3,11,2,15,2,2,2.0,1,97.54,2015
1203,4,University of Cambridge,United Kingdom,1,2,10,5,11,6,12,13.0,48,96.81,2015
1204,5,University of Oxford,United Kingdom,2,7,13,10,7,12,7,9.0,15,96.46,2015

b) Обчисліть максимальний, мінімальний і середній загальний бал світового рейтингу.

In [20]:
max_score = data_2015['score'].max()
min_score = data_2015['score'].min()
mean_score = data_2015['score'].mean().round(2)

print(max_score, min_score, mean_score)

100.0 44.02 46.86

c) Для всіх згаданих країн виведіть кількість університетів, які увійшли до світового рейтингу.

In [21]:
universities_by_country = data_2015['country'].value_counts()

print(universities_by_country)

country
USA                     229
China                    83
Japan                    74
United Kingdom           65
Germany                  55
France                   49
Italy                    47
Spain                    40
South Korea              36
Canada                   33
Australia                27
Taiwan                   21
Brazil                   18
India                    16
Netherlands              13
Austria                  12
Sweden                   11
Turkey                   10
Belgium                  10
Switzerland               9
Poland                    9
Finland                   9
Ireland                   8
Iran                      8
Israel                    7
Portugal                  7
Greece                    7
New Zealand               6
Hong Kong                 6
Hungary                   6
Czech Republic            5
Russia                    5
South Africa              5
Norway                    5
Denmark                   5
Saudi Arabia              4
Chile                     4
Egypt                     4
Thailand                  3
Argentina                 3
Malaysia                  3
Singapore                 2
Mexico                    2
Romania                   2
Colombia                  2
Slovenia                  2
Iceland                   1
Estonia                   1
Slovak Republic           1
Lebanon                   1
Croatia                   1
Lithuania                 1
Serbia                    1
Uruguay                   1
Bulgaria                  1
Uganda                    1
Cyprus                    1
United Arab Emirates      1
Puerto Rico               1
Name: count, dtype: int64

d) Обчисліть для кожної країни величину що є сумою загальних балів його університетів.

In [22]:
score_by_country = data_2015.groupby('country')['score'].sum().sort_values(ascending=False)

print(score_by_country)

country
USA                     11475.24
China                    3724.58
Japan                    3423.63
United Kingdom           3120.30
Germany                  2543.14
France                   2258.18
Italy                    2126.85
Spain                    1793.80
South Korea              1651.65
Canada                   1543.89
Australia                1236.93
Taiwan                    944.03
Brazil                    803.39
India                     712.78
Netherlands               627.10
Austria                   539.85
Sweden                    523.00
Belgium                   467.66
Switzerland               453.57
Turkey                    443.34
Finland                   409.04
Poland                    399.07
Ireland                   360.93
Israel                    358.31
Iran                      353.31
Portugal                  314.68
Greece                    313.07
Hong Kong                 276.20
New Zealand               269.55
Hungary                   266.47
Denmark                   240.27
Russia                    234.21
Norway                    232.62
South Africa              230.49
Czech Republic            223.40
Chile                     178.69
Saudi Arabia              177.17
Egypt                     176.38
Thailand                  134.76
Malaysia                  134.12
Argentina                 133.78
Singapore                 102.73
Mexico                     89.84
Slovenia                   88.98
Colombia                   88.49
Romania                    88.08
Iceland                    44.91
Estonia                    44.68
Croatia                    44.62
Slovak Republic            44.38
Lebanon                    44.38
Serbia                     44.33
Lithuania                  44.25
Bulgaria                   44.19
Uruguay                    44.16
Uganda                     44.16
Cyprus                     44.10
United Arab Emirates       44.08
Puerto Rico                44.06
Name: score, dtype: float64

e) Обчисліть кращий університет для кожної країни.

In [23]:
best_university_by_country = data_2015.loc[data_2015.groupby('country')['score'].idxmax()][['institution', 'country', 'score']]

print(best_university_by_country)

                                          institution               country  \
1566                       University of Buenos Aires             Argentina
1287                             University of Sydney             Australia
1422                             University of Vienna               Austria
1281                   Katholieke Universiteit Leuven               Belgium
1331                          University of São Paulo                Brazil
2044                                 Sofia University              Bulgaria
1231                            University of Toronto                Canada
1575          Pontifical Catholic University of Chile                 Chile
1255                                Peking University                 China
1851               University of Los Andes (Colombia)              Colombia
1750                             University of Zagreb               Croatia
2127                             University of Cyprus                Cyprus
1469                     Charles University in Prague        Czech Republic
1273                         University of Copenhagen               Denmark
1995                                 Cairo University                 Egypt
1736                              University of Tartu               Estonia
1310                           University of Helsinki               Finland
1235                              École Polytechnique                France
1275           Ruprecht Karl University of Heidelberg               Germany
1500   National and Kapodistrian University of Athens                Greece
1369                          University of Hong Kong             Hong Kong
1657                         Eötvös Loránd University               Hungary
1660                            University of Iceland               Iceland
1540             Indian Institute of Technology Delhi                 India
1896                  Sharif University of Technology                  Iran
1384                          Trinity College, Dublin               Ireland
1222                   Hebrew University of Jerusalem                Israel
1311                      Sapienza University of Rome                 Italy
1212                              University of Tokyo                 Japan
1881                    American University of Beirut               Lebanon
1990                               Vilnius University             Lithuania
1681                  University of Science, Malaysia              Malaysia
1533         National Autonomous University of Mexico                Mexico
1284                     Erasmus University Rotterdam           Netherlands
1465                           University of Auckland           New Zealand
1298                               University of Oslo                Norway
1650                          Jagiellonian University                Poland
1456                             University of Lisbon              Portugal
2161            University of Puerto Rico at Mayagüez           Puerto Rico
2185                          University of Bucharest               Romania
1258                Lomonosov Moscow State University                Russia
1768                             King Saud University          Saudi Arabia
1925                           University of Belgrade                Serbia
1264                 National University of Singapore             Singapore
1884                Comenius University in Bratislava       Slovak Republic
1703                          University of Ljubljana              Slovenia
1348                  University of the Witwatersrand          South Africa
1223                        Seoul National University           South Korea
1315                          University of Barcelona                 Spain
1270                             Karolinska Institute                Sweden
1219  Swiss Federal Institute of Technology in Zurich           Switzerland
1256                       National Taiwan University                Taiwan
1510                         Chulalongkorn University              Thailand
1669                 Middle East Technical University                Turkey
1200                               Harvard University                   USA
2068                              Makerere University                Uganda
2149                  United Arab Emirates University  United Arab Emirates
1203                          University of Cambridge        United Kingdom
2066             University of the Republic (Uruguay)               Uruguay

       score
1566   45.37
1287   51.61
1422   47.03
1281   52.03
1331   49.31
2044   44.19
1231   60.04
1575   45.31
1255   54.26
1851   44.43
1750   44.62
2127   44.10
1469   46.32
1273   52.51
1995   44.25
1736   44.68
1310   50.04
1235   59.20
1275   52.32
1500   45.94
1369   48.15
1657   44.92
1660   44.91
1540   45.54
1896   44.37
1384   47.73
1222   65.71
1311   49.97
1212   78.23
1881   44.38
1990   44.25
1681   44.84
1533   45.58
1284   51.78
1465   46.38
1298   50.81
1650   44.94
1456   46.43
2161   44.06
2185   44.04
1258   54.19
1768   44.59
1925   44.33
1264   53.44
1884   44.38
1703   44.77
1348   48.75
1223   64.82
1315   49.79
1270   52.79
1219   66.93
1256   54.23
1510   45.86
1669   44.87
1200  100.00
2068   44.16
2149   44.08
1203   96.81
2066   44.16

f) Чи є кореляція у двох останніх величин?

In [24]:
correlation_score = data_2015.groupby('country')['score'].sum().corr(data_2015.groupby('country')['score'].max())

print(correlation_score)

0.7869440076700025

g) Обчисліть п'ять університетів з найбільшим рейтингом.

In [25]:
top_5_universities = data_2015.nlargest(5, 'score')[['institution', 'score', 'country', 'national_rank']]

print(top_5_universities)

                                institution   score         country  \
1200                     Harvard University  100.00             USA
1201                    Stanford University   98.66             USA
1202  Massachusetts Institute of Technology   97.54             USA
1203                University of Cambridge   96.81  United Kingdom
1204                   University of Oxford   96.46  United Kingdom

      national_rank
1200              1
1201              2
1202              3
1203              1
1204              2

h) Випускники яких 5 університетів володіють найбільшим робочим рейтингом?

In [26]:
top_5_employment = data_2015.nlargest(5, 'alumni_employment')[['institution', 'alumni_employment']]

print(top_5_employment)

                                  institution  alumni_employment
1220      University of California, San Diego                567
1225  University of California, San Francisco                567
1228                   Rockefeller University                567
1238            Weizmann Institute of Science                567
1270                     Karolinska Institute                567

i) Який із зазначених рейтингів дає найбільший внесок у загальний рейтинг?

In [28]:
correlation_with_total = data_2015[['quality_of_education', 'alumni_employment', 'quality_of_faculty', 'publications', 'influence', 'citations', 'broad_impact', 'patents', 'score']].corr()['score'].drop('score')
most_influential_factor = correlation_with_total.idxmax()

print(most_influential_factor)

patents